DeviceEvents
| where Timestamp  >= ago(1d)
| where ActionType == "UsbDriveMounted" or ActionType == "UsbDriveUnmounted"
| extend ParsedFields=parse_json(AdditionalFields)
| project Timestamp, 
    ProductName=tostring(ParsedFields.ProductName), 
    Manufacturer=tostring(ParsedFields.Manufacturer),
    DriveLetter=tostring(ParsedFields.DriveLetter), 
    LoggedOnUsers=tostring(ParsedFields.LoggedOnUsers),ReportId, ActionType, DeviceId
